import React from 'react'
import Component from '@/Component'
import styles from './log.scss'

class Log extends Component {
  state = {
		log: ['2019-08-01 12:00:01管理员充值10000元',
			'2019-07-01 12:00:01管理员提现200元',
			'2019-08-01 02:00:01子账户A添加自定义广告',
			'2019-08-01 02:00:01子账户A修改自定义广告',
			'2019-08-01 02:00:01子账户A修改密码',
			'2019-08-01 12:00:01管理员充值10000元',
			'2019-07-01 12:00:01管理员提现200元',
			'2019-08-01 02:00:01子账户A添加自定义广告',
			'2019-08-01 02:00:01子账户A修改自定义广告',
			'2019-08-01 02:00:01子账户A修改密码',
			'2019-08-01 12:00:01管理员充值10000元',
			'2019-07-01 12:00:01管理员提现200元',
			'2019-08-01 02:00:01子账户A添加自定义广告',
			'2019-08-01 02:00:01子账户A修改自定义广告',
			'2019-08-01 02:00:01子账户A修改密码',
			'2019-08-01 12:00:01管理员充值10000元',
			'2019-07-01 12:00:01管理员提现200元',
			'2019-08-01 02:00:01子账户A添加自定义广告',
			'2019-08-01 02:00:01子账户A修改自定义广告',
			'2019-08-01 02:00:01子账户A修改密码',
			'2019-08-01 12:00:01管理员充值10000元',
			'2019-07-01 12:00:01管理员提现200元',
			'2019-08-01 02:00:01子账户A添加自定义广告',
			'2019-08-01 02:00:01子账户A修改自定义广告',
			'2019-08-01 02:00:01子账户A修改密码',
		]
	}

  render() {
    return (
      <ul className={styles.log}>
        {this.state.log.map((item, i) => (
					<li key={i}>{item}</li>
				))}
      </ul>
    );
  }
}

export default Log
